{"sections":{"main":{"type":"main-page","settings":{}},"faq_CGxRzG":{"type":"faq","blocks":{"question_KKYQAi":{"type":"question","settings":{"title":"What does the Lifetime Manufacturing Warranty cover?","text":"<p>All the jewelry sold on our website comes with a lifetime Manufacturing Warranty against any manufacturing defects in materials and workmanship. <\/p>"}},"question_aTM8iE":{"type":"question","settings":{"title":"Is the warranty transferable?","text":"<p>No, it isn’t transferable and applies solely to the first possessor of the product coming with a Lifetime Manufacturing Warranty.<\/p>"}},"question_bmFACR":{"type":"question","settings":{"title":"Do you offer financing options for purchases?","text":"<p>You are in luck since we offer various payment methods to enable you to take care of your acquisition. For additional information on plans and options that we offer you may visit our website or contact our Customer Service department.<\/p>"}},"question_yyxjLi":{"type":"question","settings":{"title":"How do I apply for financing?","text":"<p>In terms of payment, you can request credit facilities when you are doing your checkout on the website. All you have to do is find the financing you want and apply for it in the easy steps provided for you.<\/p>"}},"question_TUqWki":{"type":"question","settings":{"title":"How is your jewelry crafted?","text":"<p>It’s always important that our jewelry should be made from high quality materials and with precision. Every piece they produce passes through several quality control processes to ascertain that it is up to our quality.<\/p>"}},"question_b3k9pY":{"type":"question","settings":{"title":"Can I customize my jewelry?","text":"<p>Yes! Many of the jewelry items that we sell can be personalized. Instead, you can select diverse settings, types of metals, and stones and make a jewelry piece that would best fit your personality.<\/p>"}},"question_6aaKgj":{"type":"question","settings":{"title":"Can I add engravings to my jewelry?","text":"<p>Absolutely! We offer engraving options on your rings at the final stage of constructing your rings here on the site. This will enable them to have a special message or date put on the piece before giving it out.<\/p>"}},"question_cQx4he":{"type":"question","settings":{"title":"How do I request a resizing for my jewelry?","text":"<p>In case you would like to request your product for resizing, you can use the Contact Information below: Email address: care@stienhardt. com. Usually resizing takes about fourteen days or two weeks on average depending on the kind of resizing to be done.<\/p>"}},"question_iDtXia":{"type":"question","settings":{"title":"Are your diamonds ethically sourced?","text":"<p>Yes, we do operate an ethical company and we do not engage in any wrongdoings. Our lab-grown diamonds are chemically and physically identical to mined diamonds but are utterly free from the negatives associated with mining such as conflict diamonds and the deleterious impact they have on the environment.<\/p>"}},"question_D8YRjG":{"type":"question","settings":{"title":"Is my order insured during shipping?","text":"<p>Yes, all the shipments from Stienhardt & Stones are addressed with insurance, therefore customers’ jewelry is protected when in transit.<\/p>"}},"question_3NCBEV":{"type":"question","settings":{"title":"How can I track my shipment?","text":"<p>When your order is shipped you will receive a tracking number to track the progress of your shipment till it is delivered to you.<\/p>"}},"question_ph8n3w":{"type":"question","settings":{"title":"What is the return policy for jewelry?","text":"<p>Customers need to request a return from our Customer Service within 15 days from the delivery date. Products are expected to be unused, packed with their accessories, labeled, and in their initial container. If returns are made late or are specific orders then the company may charge up to fifty percent as the restocking fees.<\/p>"}},"question_xMxbxE":{"type":"question","settings":{"title":"How long does it take to process a return?","text":"<p>Refund will take 5 business days to be processed once we have received and inspected the returned item and this will be done the same method of payment used as the initial payment.<\/p>"}},"question_9ERgxD":{"type":"question","settings":{"title":"Can I create a custom ring or piece of jewelry?","text":"<p>Yes! We allow for orders of specially made rings and other jewelry with people’s preferences in mind. For any help in customizing your item or to get the quote please contact our Customer Service department.<\/p>"}},"question_EfmR3E":{"type":"question","settings":{"title":"How long does it take to create a custom piece?","text":"<p>The time it takes to create a piece depends on the details that have been put in by the artist. Usually, it can take several weeks or even a month and a half or so depending on the nature of the instructions and advice given. Our team will give you a probable time frame during the implementation of the design plans.<\/p>"}},"question_jyYHRx":{"type":"question","settings":{"title":"Can I upgrade my diamond or jewelry piece?","text":"<p>Yes, we do provide the option of upgrading your diamond or jewelry item in case you so wish to. For details on the available upgrade and the process to get there please contact our Customer Service department.<\/p>"}}},"block_order":["question_KKYQAi","question_aTM8iE","question_bmFACR","question_yyxjLi","question_TUqWki","question_b3k9pY","question_6aaKgj","question_cQx4he","question_iDtXia","question_D8YRjG","question_3NCBEV","question_ph8n3w","question_xMxbxE","question_9ERgxD","question_EfmR3E","question_jyYHRx"],"settings":{"title":"FAQs"}},"faq_gBfr8w":{"type":"faq","blocks":{"question_fTaBxQ":{"type":"question","settings":{"title":"***","text":"<p>**<\/p><p><\/p>"}}},"block_order":["question_fTaBxQ"],"disabled":true,"settings":{"title":"DIAMOND PRICE MATCH"}},"faq_TtDzRf":{"type":"faq","blocks":{"question_nzaN9w":{"type":"question","settings":{"title":"Military Discount","text":"<p>***<\/p>"}}},"block_order":["question_nzaN9w"],"disabled":true,"settings":{"title":"ID.me DISCOUNT"}}},"order":["main","faq_CGxRzG","faq_gBfr8w","faq_TtDzRf"]}