{"sections":{"main":{"type":"main-page","settings":{}},"advanced_content_aeQxj8":{"type":"advanced-content","blocks":{"image_T49mEq":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/gemological-and-jewellery-institute-and-gem-testing-lab-lajpat-nagar-2-delhi-gemstone-dealers-rw2gph4h7s.jpg","link":"","width":"50%","alignment":"center"}},"liquid_FG7GCn":{"type":"liquid","settings":{"code":"<div class=\"content  medium-up--text-center small--text-center\">\n                    \n                    \n                        <h1 class=\"section-header\"> Your Perfect Ring Starts Here<\/h1>\n                    \n                    \n                        <p>Navigating the search for a ring that perfectly captures your loved one's essence can feel daunting. Rest assured, we're here to guide you. Think of this as your compass, your guide through the world of engagement rings. Below, discover the components that define each ring's uniqueness and learn how to personalize it to reflect your vision. Let's embark on creating the engagement ring you've always imagined.<\/p>\n                    \n                    \n                <\/div>","width":"50%","alignment":"center"}}},"block_order":["image_T49mEq","liquid_FG7GCn"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}},"multi_slider_section_imbUTA":{"type":"multi-slider-section","blocks":{"tabs_3VPD9E":{"type":"tabs","settings":{"heading":"CLASSIC"}},"tabs_RPFxVU":{"type":"tabs","settings":{"heading":"Pave Diamonds"}},"tabs_LKDCUT":{"type":"tabs","settings":{"heading":"HALO Setting"}},"tab_slider_fkw3jF":{"type":"tab_slider","settings":{"description":"Classic engagement ring styles such as the timeless solitaire and the elegant Venetian hidden halo setting epitomize enduring beauty and sophistication. The solitaire, with its singular, dazzling center stone, symbolizes purity and eternal love, making it a beloved choice for generations. Meanwhile, the Venetian hidden halo setting adds a touch of intricacy and allure with its delicate halo of diamonds subtly nestled beneath the main gem, enhancing its brilliance and allure. These iconic styles not only celebrate tradition but also embody the essence of everlasting commitment and romance.","image":"shopify:\/\/shop_images\/Rose_Gold_Header.jpg"}},"tab_slider_8UGRWk":{"type":"tab_slider","settings":{"description":"A pave diamond ring, exemplified by designs like the Sunbelt setting and Lux setting, offers a luxurious and radiant expression of love. The Sunbelt setting features a band adorned with closely set small diamonds, creating a shimmering halo around the center stone. This design enhances the brilliance and allure of the ring, symbolizing an eternal bond that shines brightly.\n\nSimilarly, the Lux setting elevates sophistication with its intricate pave diamonds encrusting the band and often extending to the setting, emphasizing a lavish and glamorous aesthetic. These pave diamond styles not only exude elegance but also signify a commitment that sparkles with every glance, making them perfect for those who appreciate timeless beauty and refined craftsmanship.","image":"shopify:\/\/shop_images\/Radiant_Header_Picture.jpg"}},"tab_slider_JGcjmz":{"type":"tab_slider","settings":{"description":"The halo setting is a timeless and antique-inspired design that adds an extra layer of elegance to any engagement ring. By encircling the center stone with a ring of smaller diamonds, the halo setting not only enhances the diamond's size and brilliance but also creates a vintage aesthetic reminiscent of romantic eras past.\n\nThis classic style has endured through generations, symbolizing everlasting love and sophistication. Its antique charm appeals to those who appreciate tradition and craftsmanship, making it a cherished choice for couples seeking a ring that blends timeless elegance with modern allure.","image":"shopify:\/\/shop_images\/Hidden_Halo_Header.jpg"}}},"block_order":["tabs_3VPD9E","tabs_RPFxVU","tabs_LKDCUT","tab_slider_fkw3jF","tab_slider_8UGRWk","tab_slider_JGcjmz"],"settings":{"heading":"","sub_heading":"Engagement ring Styles","description":""}},"ring_popup_section_9m3Dzk":{"type":"ring-popup-section","blocks":{"tabs_XBqac7":{"type":"tabs","settings":{"heading":"YELLOW GOLD","description":"Choose 18 karat yellow gold for its deep, rich color that echoes the elegance of past generations' engagement rings. Alternatively, opt for 14 karat yellow gold, which lends a subtle, warm glow to your ring. Yellow gold can also enhance the appearance of lower color grade diamonds, making it a smart choice for achieving your ideal ring within a budget.."}},"tabs_fQMMgc":{"type":"tabs","settings":{"heading":"White Gold","description":"White gold offers a brilliant choice among metal options. Both 14 and 18 karat white gold boast exceptional scratch resistance, with 14 karat slightly edging out 18 in durability. Your primary decision lies in color preference. While both options shine brightly, 14 karat white gold presents a more pronounced and bold shade of white compared to 18 karat."}},"tabs_i8DjrN":{"type":"tabs","settings":{"heading":"ROSE GOLD","description":"Rose gold is renowned for symbolizing romantic love, which contributes to its widespread popularity. The metal's romantic glow is attributed to its copper alloy. Choose 14 karat rose gold for a pinker hue, or opt for 18 karat rose gold for a tone closer to champagne. Whatever significance rose gold holds for you, it adds a touch of romance and elegance to your ring."}},"tabs_rygQhi":{"type":"tabs","settings":{"heading":"PLATINUM","description":"Platinum remains a timeless favorite valued for its exceptional strength and durability. Unlike gold, which loses material when scratched, platinum moves, retaining its integrity. A quick professional polishing restores a platinum ring to its original luster, making it look as good as new without any lasting damage. Some individuals even appreciate the distinctive patina that develops on platinum over time, adding character and enhancing its unique appeal."}}},"block_order":["tabs_XBqac7","tabs_fQMMgc","tabs_i8DjrN","tabs_rygQhi"],"settings":{"heading":"","sub_heading":"What Metal Should I choose?","description":"The choice of metal can completely transform the look of your ring. While a particular style may evoke an antique feel in yellow gold, it can take on a modern interpretation of vintage in white gold. Our goal is to assist you in discovering the metal that best complements your unique personal style."}},"advanced_content_HzMR6r":{"type":"advanced-content","blocks":{"liquid_H7ayUc":{"type":"liquid","settings":{"code":"<div class=\"text-content text-center\">\n     \n      \n        <h2 class=\"section-header text-uppercase\">Engagement ring sizing<\/h2>\n      \n      \n        <p>Ensuring your engagement ring fits comfortably and securely on your finger, effortlessly sliding over the knuckle, is key. At Stienhardt, we provide rings in all standard sizes, including half and quarter sizes, so you can confidently find the perfect fit.<\/p>\n      \n      \n<a href=\"\/pages\/ring-sizing\" class=\"btn border-button\" id=\"\" data-uw-rm-brl=\"PR\" data-uw-original-href=\"https:\/pages\/ring-sizing\">ring size conversion chart<\/a>\n    <\/div>","width":"100%","alignment":"center"}}},"block_order":["liquid_H7ayUc"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}},"helpandsupport_hcqeUg":{"type":"helpandsupport","settings":{"heading":"We're here to help.","description":"Our expert gemologists are here to help.\nWe’re available seven days a week to guide you on\ndiamonds, gemstones, and jewelry.","chat_url":"#","email":"#","phone":"#"}}},"order":["main","advanced_content_aeQxj8","multi_slider_section_imbUTA","ring_popup_section_9m3Dzk","advanced_content_HzMR6r","helpandsupport_hcqeUg"]}