{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"rich_text_pETGF7":{"type":"rich-text","blocks":{"heading_MtE7zw":{"type":"heading","settings":{"title":"JEWELRY METALS"}},"text_qemcre":{"type":"text","settings":{"enlarge_text":true,"text":"<p>At Steinhardt, we specialize in pairing gemstone and diamond jewelry with a range of precious metals. Your choice of metal can reflect preferences for durability, aesthetics, and cost. Each metal offers unique characteristics such as luster, weight, and color, influencing its appeal. We proudly craft our jewelry using responsibly sourced gold and platinum, ensuring eco-friendly practices. These metals are celebrated for their exceptional durability and visual allure, distinguishing them as premier choices in fine jewelry. As rare and valuable metals, gold and platinum are classified as precious, embodying luxury and timeless elegance in every piece we create.<\/p>"}}},"block_order":["heading_MtE7zw","text_qemcre"],"custom_css":["h2 {font-size: 36px; line-height: 45px; margin-bottom: 20px;}"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"advanced_content_HMNi9C":{"type":"advanced-content","blocks":{"liquid_XgYVwK":{"type":"liquid","settings":{"code":"<div class=\"content  medium-up--text-center small--text-center\">\n                    \n                    \n                        <h2 class=\"section-header\">GOLD<\/h2>\n                    \n                    \n                        <p> \nGold has been a cornerstone of jewelry for centuries, prized for its versatility in color. It is predominantly available in white, yellow, and rose hues. White gold complements all gemstones and diamonds with its adaptable shine. Yellow gold, a traditional favorite, pairs beautifully with both colored gemstones and diamonds. Rose gold, with its distinctive pink hue, represents a stylish and modern choice, adding a striking touch to any jewelry piece.<\/p><\/div>","width":"50%","alignment":"center"}},"image_3nA6bf":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Gold_Shades.jpg","link":"","width":"50%","alignment":"center"}}},"block_order":["liquid_XgYVwK","image_3nA6bf"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}},"advanced_content_JJLphE":{"type":"advanced-content","blocks":{"image_TKMDfn":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Platinum_Ring.webp","link":"","width":"50%","alignment":"center"}},"liquid_8JHhR8":{"type":"liquid","settings":{"code":"<div class=\"content  medium-up--text-center small--text-center\">\n                    \n                    \n                        <h2 class=\"section-header\">PLATINUM<\/h2>\n                    \n                    \n                        <p>Platinum, a precious metal, is rarer and pricier than gold. It boasts a silvery-white color and is renowned for its exceptional durability. Platinum is favored for its resistance to abrasion and scratches, making it an excellent choice for jewelry that sees regular wear, such as rings and wedding bands. This versatile metal complements any gemstone or diamond, enhancing the beauty and longevity of every piece.<\/p><\/div>","width":"50%","alignment":"center"}}},"block_order":["image_TKMDfn","liquid_8JHhR8"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}},"advanced_content_iwKVTz":{"type":"advanced-content","blocks":{"liquid_YmMTED":{"type":"liquid","settings":{"code":"<div class=\"text-content text-center\">\n      \n      \n        <h2 class=\"section-header text-uppercase\">Alloy and Metals<\/h2>\n      \n      \n        <p>We often overlook the privilege of being able to purchase jewelry whenever we desire, including the freedom to choose the metal for our rings. The manufacturing of gold rings involves significant effort, with various alloys and metals playing crucial roles in their production.<\/p><p>Alloys are metals combined with other elements to enhance their strength and resistance to corrosion. They are used because pure metals often lack the necessary properties for certain applications. For example, while iron is suitable for construction, steel—a stronger, more durable, and rust-resistant alloy made with carbon and other materials—is preferred. Aluminum, lightweight but soft in its pure form, benefits from alloying to improve its properties. In jewelry making, alloys such as copper, iron, nickel, silver, tin, zinc, cadmium, titanium, and manganese are commonly mixed with gold to create desired characteristics.<\/p><p> These alloys not only enhance the strength of gold but also influence other properties. Some gold engagement rings can cause a dark stain on the wearer's finger or trigger allergic reactions like rashes and blisters. Despite these considerations, gold remains highly versatile and popular. It can be crafted into various shapes, and if it is 18k or higher, it maintains its luster without tarnishing or causing irritation. White gold engagement rings, often made from gold alloyed with lighter metals and plated with rhodium, are a preferred alternative to platinum due to their appearance and cost-effectiveness. Classified as a platinum metal, white gold is the second whitest precious metal after silver. <\/p>\n      \n      \n        <\/div>\n    <\/div>","width":"100%","alignment":"center"}},"image_DQppd3":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Ansh_Jodhani9850_1.jpg","link":"","width":"100%","alignment":"center"}},"liquid_VgWDz3":{"type":"liquid","settings":{"code":"<div class=\"text-content text-center\">\n      \n        <p class=\"sub-title\">Advantages\/Disadvantages of using different gold alloys for jewelry:<\/p>\n      \n      \n      \n        <p>18k yellow gold contains 75% pure gold alloyed with silver, zinc, cobalt, and copper, resulting in a luxurious appearance and texture for yellow gold engagement rings. Unlike plated gold, 18k gold is not coated and is highly malleable, although it may occasionally cause skin irritation. One drawback is its lower scratch resistance compared to lower purity alloys. However, even with heavy use, it maintains its integrity over many years.<\/p><p>White Gold: With white gold, which is also 75% gold with copper, palladium, zinc and nickel alloys, it is a whitish metal, which can be used in place of Platinum engagement rings, if it has rhodium plating. White gold, or platinum rings, has a higher resistance than 18k yellow gold, to bending, or scratching. They possess high density and are very solid and can be very workable. On the other hand, for white gold, or platinum to have a high luster, it will require rhodium plating. If the wearer has an allergy to nickel, then it will cause an irritation and takes a long time to wear down. <\/p><p>18k Palladium white gold: Consists of 75% gold and only 25% palladium. This metal can also be substituted for engagement ring platinum, as the metal is whitish and resembles platinum when it is plated with rhodium. It does not often cause skin irritation, if ever. It is workable and possesses a high density and is also very solid. The disadvantages are that it has to be plated with rhodium, will wear down, even if it is over a period of time, and costs more than 18k nickel alloy. When it comes to a choice of white gold vs. platinum <\/p><p> 14K yellow or white gold: Last, but not least, is the 14k yellow or white gold, which is the most popular of the four. 14k gold is stamped for identification purposes, possesses a mixture of 58% of the purest gold with a make-up of other metals, such as silver, nickel, copper, and zinc, amounting to 42% and is identified by the “14k” stamped on the link or lock. 14k gold requires no plating, is heavily resistant to bending or scratching and will not, in many cases, cause skin irritation. It is more cost effective that platinum alloys, or 18k gold, but is somewhat lighter than the 18k gold. It is more difficult to work with and is less resistant than its 18k counterpart.<br role=\"presentation\" data-uw-rm-sr=\"\"><\/p>\n      \n      \n\n    <\/div>","width":"100%","alignment":"center"}}},"block_order":["liquid_YmMTED","image_DQppd3","liquid_VgWDz3"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}},"advanced_content_q3dYdW":{"type":"advanced-content","blocks":{"liquid_f7eXWd":{"type":"liquid","settings":{"code":"<div class=\"text-content text-center\">\n      \n      \n        <h2 class=\"section-header text-uppercase\">Metal Hardness &amp; Strength<\/h2>\n      \n      \n        <p>When it comes to precious metals, there is a distinct difference between their hardness and their strength. Hardness, or HV, is how scratch resistant the metal is when the surface is pierced with a pointed object that has load and gauging penetration. Hardness and scratch resistance is measured with the Vickers Hardness scale. Durability, or PSI, is measured by the pounds in each square inch and is tested when the tensile strength is measured for overall durability with pressure that could break the material.<\/p>\n      \n      \n\n    <\/div>","width":"100%","alignment":"center"}},"liquid_tUzz9Y":{"type":"liquid","settings":{"code":"<div class=\"text-content text-center\">\n      \n      \n        <h2 class=\"section-header text-uppercase\">Platinum Metal<\/h2>\n      \n      \n        <p>Platinum is normally marked with a PLAT, or “950pt.” if a ring contains 90% platinum it is hard and marked as 900pt, while if it is 50-90% it is marked PLAT and has no indicator of purity. Alloys which contain less than 50% of platinum is not marked based on FTC rules. The highest temperature for melting platinum is 950 parts platinum with 50 parts ruthenium, so it is hard to cast, while it is a darker gray than platinum mixed with iridium.<\/p><p>Setters recommend that this be used on diamond jewelry only, as diamonds require more pressure when they are being set. PT950\/ru is extremely hard and as a result, more resistant to wear and tear over time. <\/p><p> PT 900 and 950\/Ir are hard and medium alloys; one is relatively hard and the other malleable. Both are white and soft, so they are both great with handmade jewelry. The softer the metal, the longer the polishing process, but they are both more scratch and bend resistant than alloys that are harder. They also hold the stones better in the event of an impact and are both resistant to wear and tear. Platinum mixed with 50 parts cobalt (PT950\/Co), is also somewhat hard. It is great for making fine jewelry and also for filigree jewelry. Great craftsmanship is as critical in the process as the material, but there is no alloy for platinum is better than any other.<\/p><p><\/p>\n      \n      \n<a href=\"\/pages\/contact-us\" class=\"btn border-button\" id=\"\" data-uw-rm-brl=\"PR\" data-uw-original-href=\"\/pages\/contact\">Contact us<\/a>\n    <\/div>","width":"100%","alignment":"center"}}},"block_order":["liquid_f7eXWd","liquid_tUzz9Y"],"settings":{"full_width":false,"space_around":true,"lazyload_images":true}}},"order":["main","rich_text_pETGF7","advanced_content_HMNi9C","advanced_content_JJLphE","advanced_content_iwKVTz","advanced_content_q3dYdW"]}