{"sections":{"shogun-helper":{"type":"shogun-helper","settings":{}},"main":{"type":"main-page","settings":{}},"our_story_3qY7mN":{"type":"our-story","settings":{"heading":"Our Story","description":"<p>Stienhardt & Stones is one of the reputed manufacturers and suppliers of laboratory-grown diamonds in the United States. The diamonds are virtually indistinguishable from mined diamonds in terms of chemical composition, structure, and optical properties and are certified by major gemological laboratories. We have high-quality engagement rings and other fine jewelry that are made to last and stand the test of time.<\/p>"}},"our_mission_and_vision_tf67Wh":{"type":"our_mission_and_vision","settings":{"heading_1":"Our Mission","heading_2":"Our Vision","description_1":"<p>To transform the jewelry industry by providing superior quality, conflict-free lab-created diamonds that are chemically and visually identical to earth-mined diamonds. We want to produce creations that are love tokens, and which represent everlastingness.<\/p>","description_2":"<p>All that will be fabricated fine jewelry in this world will follow the RTM luxury principle, Responsible, Transparent, and Meaningful. In order to meet this responsibility, we hold ourselves to provide superior lab-grown diamonds and guarantee them.<\/p>"}},"our_approach_b8EfUi":{"type":"our_approach","settings":{"main_heading":"Our approach","heading_1":"Customizable","heading_2":"Collaborative","heading_3":"Crafted","main_description":"<p>At Stienhardt & Stones, we blend craftsmanship, sustainability, and ethical sourcing to create timeless, beautiful jewelry.<\/p>","description_1":"So we are aware of the fact that every patron whom we are going to serve is unique in one way or another at least as far as their needs and wants are concerned. You will be dealing with our team of professionals who will assist you through the whole process and make sure that all our services are well coordinated to suit your needs.","description_2":"We remain accessible to our clients and share with you all the necessary information and ideas as we implement your ideas. This is why our operations involve close collaboration between our team and your organization – to make certain that your requirements are fulfilled and your expectations are surpassed.","description_3":"Our ability to pay attention to detail and work meticulously to provide quality work as well as assure that our work meets and or exceeds aesthetic standards entrenches our solutions. Established and incorporated with the primary objective of producing top-quality and well-designed buildings, Magellan completes every project with meticulous precision."}},"our_culture_Ktw7wF":{"type":"our_culture","settings":{"heading":"Our Culture","description_1":"<p>At Stienhardt & Stones, our culture values creativity, integrity, and sustainability, crafting jewelry with passion and purpose.<\/p>","description_2":"<p>It is important to us that everyone who works at Steinhardt & Stones is treated with respect and is often told to be creative and work as a team. People are important to us, and we want everyone to share their thoughts, hobbies, and tastes. The teamwork structure also encourages creativity and guarantees that our creations conform to the rich creativity of the designers. We are passionate about ensuring our workplace environment is interactive and inviting for all employees to give their best.<\/p>"}},"sustainability_initiatives_6CiBay":{"type":"sustainability_initiatives","settings":{"heading":"Sustainability Initiatives","description_1":"<p>Stienhardt & Stones is committed to sustainability, using ethical materials and eco-friendly practices to create timeless jewelry.<\/p>","description_2":"<p>With every service that we deliver to our clients, the culture of sustainability is imbibed in Stienhardt & Stones. We can tell you that our lab-grown diamonds offer not only an ethical solution to mined diamonds but also have small environmental footprints. The Company is anxious to reduce waste throughout its operations, and we require our suppliers to have similar attitudes. It is our mission to produce one-of-a-kind jewelry that does not harm the Earth or its inhabitants, and our accessories are as ethical as they are stunning.<\/p>"}},"explore_our_collection_ftcLty":{"type":"explore_our_collection","settings":{"heading":"Explore Our Collection","description":"<p>Explore the gorgeous selection of engagement rings and other beautiful jewelry sets with Grown Diamonds. All of them are created with the idea that they should be treasured for many years and they should impact the environment in the least way possible.<\/p>"}},"contact_us_details_yYtH9h":{"type":"contact_us_details","settings":{"heading":"Connect with Us","description":"<p>This is where your journey towards ethical elegance begins. Contact us now and learn how Stienhardt & Stones can assist you in the search for the ideal fine jewelry or the designing of a unique custom piece.<\/p>","Text_1":"Still need help?","Text_2":"Contact Customer Service"}},"shogun-optimizer":{"type":"shogun-optimizer","settings":{}},"1730870437acb504a2":{"type":"apps","blocks":{"vtn_power_wishlist_wishlist_page_aicPn4":{"type":"shopify:\/\/apps\/vtn-power-wishlist\/blocks\/wishlist-page\/34fa14e7-8d7f-4439-90bc-6df3e3aa6e10","disabled":true,"settings":{"items-per-row-desktop":"4","items-per-row-mobile":"2","image-aspect-ratio":"portrait","hide-vendor":false,"enable-move-to-cart":false,"bulk-add-to-cart":"Add all items to cart","add-to-cart-button-text":"Add to Cart","sold-out-button-text":"Sold Out","view-cart-message":"View Cart","empty-wishlist-heading":"Wishlist is empty!","empty-wishlist-cta-text":"Explore","empty-wishlist-cta-link":"shopify:\/\/collections\/all","all-sold-out-text":"Please choose and update the products as per availability!","guest-customer-message":"Please <a href=\"\/account\/login\">login<\/a> to save your wishlist","text":"#000000","background":"#ffffff","border-color":"#000000","btn-radius":0,"btn-border-width":1,"external_script":false}}},"block_order":["vtn_power_wishlist_wishlist_page_aicPn4"],"settings":{"full_width":false,"space_around":true}}},"order":["shogun-helper","main","our_story_3qY7mN","our_mission_and_vision_tf67Wh","our_approach_b8EfUi","our_culture_Ktw7wF","sustainability_initiatives_6CiBay","explore_our_collection_ftcLty","contact_us_details_yYtH9h","shogun-optimizer","1730870437acb504a2"]}